subject_list = {
    '': '',
    'оп':'OP',
    'ооп':'OP',
    'основи програмування':'OP',
    'основы программирования':'OP',
    'основы':'OP',
    'основи':'OP',
    'op':'OP',
    'oop':'OP',
    'прога':'OP',

    'линейная алгебра':'LA',
    'лінійна алгебра':'LA',
    'линейка':'LA',
    'лінійка':'LA',
    'линейная':'LA',
    'лінійна':'LA',
    'алгебра':'LA',
    'ла':'LA',
    'la':'LA',
    'lin':'LA',

    'мат. анализ':'MA',
    'мат. аналіз':'MA',
    'мат.анализ':'MA',
    'мат.аналіз':'MA',
    'мат.анал':'MA',
    'мат анал':'MA',
    'мат':'MA',
    'матан':'MA',
    'matan':'MA',
    'математика':'MA',
    'математический анализ':'MA',
    'математичний аналіз':'MA',
    'вышка':'MA',
    'вишка':'MA',
    'вища математика':'MA',
    'высшая математика':'MA',
    'ma':'MA', #eng
    'ма':'MA', #rus

    'английский':'EN',
    'англійська':'EN',
    'іноземна мова':'EN',
    'іноземна мова':'EN',
    'англійська':'EN',
    'англ':'EN',
    'english':'EN',
    'ан':'EN',
    'en':'EN',
    'eng':'EN',

    'дискретна математика':'DM',
    'дискретная математика':'DM',
    'дискретка':'DM',
    'дискретная':'DM',
    'дискретна':'DM',
    'dis':'DM',
    'dm':'DM',
    'дм':'DM',

    'основи операційних систем':'OOS',
    'основы операционных систем':'OOS',
    'операционка':'OOS',
    'ос':'OOS',
    'оос':'OOS',
    'oos':'OOS',
    'os':'OOS',

    'історія україни':'HU',
    'історія':'HU',
    'история украины':'HU',
    'история':'HU',
    'history':'HU',
    'іу':'HU',
    'ИУ':'HU',
    'hu':'HU',

}

full_names = [('Основи програмування', 'Лінійна алгебра'),
                ('Математичний аналіз', 'Дискретна математика'),
                ('Англійська мова', 'Основи операційних систем'),
                ['Історія України']]

grouped = ['EN']

short_names = ['OP', 'LA', 'MA', 'EN', 'HU', 'DM', 'OOS']